class Indexer {
    static splitChars = [' ', '.', ',', '!', '?', ':', '-', '\r', '\n', '"', '\'', '«', '»'];
    sentencesIdByWord = new Map(); // Map<string, Set<number>>
    phrases = [];
    wordsByChars = new Map();

    /**
     * 
     * @param {Number} id 
     * @param {Array<string>} sentences
     */
    constructor (sentences) {
        for (let i = 0; i < sentences.length; i++) {
            for (let word of sentences[i].split(' ')) {
                if(!this.sentencesIdByWord.has(word)) {
                    this.sentencesIdByWord.set(word, new Set());
                }
                if (!this.sentencesIdByWord.get(word).has(i)) {
                    this.sentencesIdByWord.get(word).add(i);
                }
            }
        }


        // for (let word of this.sentencesIdByWord.keys()) {
        //     for (let char of word.charAt(0)) {
        //         if (!this.wordsByChars.get(char)) {
        //             this.wordsByChars.set(char, new Set());
        //         }
        //         if (!this.wordsByChars.get(char).has(word)) {
        //             this.wordsByChars.get(char).add(word);
        //         }
        //     }
        // }
        this.phrases = Array.from(this.sentencesIdByWord.keys()).sort();
    }

    getSentencesIds(word) {
        return this.sentencesIdByWord.get(word);
    }

    // getWordsByChar(char) {
    //     return this.wordsByChars.get(char);
    // }

    _appendHashSet(hashSet, values) {

    }
}

class IndexerTester {
    static init() {
        let indx = new Indexer(this.phrases);
        console.log(indx.getSentencesIds('СССР'));
        console.log(indx.getWordsByChar('А'));
    }

    static phrases = [
        "АН СССР  ИФПАН имени С. И. Вавилова",
        "МГУ имени М. В. Ломоносова",
        "АН СССР",
        "МИАН имени В. А. Стеклова",
        "ИМГКРM АН СССР и МГ СССР",
        "ГИАН",
        "АН СССР  ИЭМЖАН имени А. Н. Северцова",
        "ЦИТО МЗ СССР",
        "АМН СССР",
        "ИЭКО АМН СССР",
        "НИИСХ",
        "ВНИИЛК МСХ СССР",
        "ВПИНИ «Гидропроект» имени С. Я. Жука",
        "ЦНИИТМАШ",
        "Московского автомобильного завода имени И. А. Лихачёва",
        "Московского карбюраторного завода",
        "ВНИИТ",
        "МЭИ",
        "ЭНИИМРС",
        "ВНИПКИММ",
        "ГНИИМ",
        "ИА МПСАСУ СССР",
        "ОКБ",
        "ГНИЭТИ",
        "ЦНИПКИПШС",
        "ГПКЭИУМС",
        "МГИ",
        "ГПИ «Центрогипроруда»",
        "ГУ ММССР СССР",
        "ПИ «Фундаментпроект»",
        "ВНИИЖДТ",
        "МПС СССР",
        "ГСИ",
        "ВНИПКИММС",
        "ВНИКТИИП",
        "ГСИПМЗ",
        "ПИ Госстроя СССР",
        "НИИЖБ Госстроя СССР",
        "МЭТП СССР",
        "ИАЭ имени И. В. Курчатова",
        "МЭЭ СССР",
        "института Теплоэнергопроект",
        "Геолог партии",
        "Амакинской экспедиции",
        "ИТЭФАН",
        "ФИАН имени П. Н. Лебедева",
        "НИКИЭТ",
        "АН СССР ",
        "НИЭИ при Госплане СССР",
        "ЦЭМИАН",
        "ЦСУ СССР",
        "Почвенного института имени В. В. Докучаева",
        "АМН СССР  ВНИИАГ МЗ СССР",
        "АМН СССР  ИИАГ Грузинской ССР",
        "НИИАГ АМН СССР",
        "АМН СССР  ИЭМ АМН СССР",
        "МИСиС",
        "ГНИПИАППОС",
        "ОКБМ МЭЛЗ",
        "МГСПИ",
        "ГПКЭИСМС",
        "НИИЧМ имени И. П. Бардина",
        "ВНИИЭМ",
        "института «Гидропроект»",
        "МС СССР",
        "ГНИИР",
        "ОКБ МЭИ",
        "ВНИКТИТП",
        "ЦНИИЧМ имени И. П. Бардина",
        "ВНИИС",
        "ГВНИИПППСМ",
        "ВННИМПСМ",
        "ГНИИППЖП",
        "Госплана СССР",
        "ИОАН имени П. П. Ширшова",
        "Нет данных",
        "ИМБАН имени В. А. Энгельгардта",
        "ИРЛАН (Пушкинский дом)",
        "ИПГФ",
        "2-го ММИ имени Н. И. Пирогова",
        "Института кардиологии имени А. Л. Мясникова АМН СССР",
        "ВПТИТМ",
        "ВНИАЧМ",
        "ИТМВТАН",
        "ОКБ при 1-м МЗР",
        "1-го МЗР",
        "«Мосбассгипрогормаш»",
        "МСЗ",
        "Подмосковного НИПКУИ",
        "института «Гипроуглеавтоматизация»",
        "ГИППЦМ",
        "Главмосстроя",
        "ММССР СССР",
        "ГПИ «Промстальпродукция»",
        "СУ № 12 треста «Мосстрой-2» Главмосстроя",
        "треста «Спецжелезобетонстрой» Главспецпромстроя",
        "ЦНИИЭП зрелищных зданий и спортивных сооружений",
        "«Спецстальконструкция»",
        "Главспецпромстроя",
        "ВНИПИ «Теплопроект»"
    ]
}